Repository: fredgoum/I-Fungi
Catalog: source/translation/*.po
Languages: fr

source: Criteria
fr: Critères

source: Result
fr: Resultat

source: Please select criteria to see results !!
fr: Selectionner des critères pour afficher des resultats

source: sort by GENUS or <br>SPECIES
fr: Trié par GENES ou <br>ESPECES

source: There is no species
fr: Il n'y a pas d'espèces correspondant

source: Help Criteria
fr: Aide Criteres

source: Overview
fr: Vue d'ensemble

source: Description of specie
fr: Desciption de l'espèce

source: MORPHOLOGICAL <br> IDENTIFICATION
fr: IDENTIFICATION <br> MORPHOLOGIQUE

source: EDUCATIVE <br> RESSOURCES
fr: RESSOURCES <br> EDUCATIVES

source: SEARCH <br> FUNGAL SPECIES
fr: RECHERCHE <br> ESPECES FONGIQUES

source: MOLECULAR <br> IDENTIFICATION
fr: IDENTIFICATION MOLECULAIRE

source: Phylogeny
fr: Phylogenie

source: DIVERSITY
fr: DIVERSITE

source: List of species
fr: Liste des espèces

source: Libraries of sequences
fr: Bibliothèque de sequences

source: About us
fr: A propos de nous

source: Back
fr: Retour

source: Hide
fr: Cacher

source: Sorry my description is not ready yet
fr: Ma description n'est pas prête
